### Pandas tutorial

In [1]:
import pandas as pd

In [2]:
data = {
    "name": ["Anuj", "Aayush", "Ratish", "Aenish", "Aayushya", "Sushil"],
    "age": [21,22,23,24,25,26],
    "address": ["Bkt", "Bkt", "Bkt", "Ktm", "Ktm", "Ktm"]
}
data

{'name': ['Anuj', 'Aayush', 'Ratish', 'Aenish', 'Aayushya', 'Sushil'],
 'age': [21, 22, 23, 24, 25, 26],
 'address': ['Bkt', 'Bkt', 'Bkt', 'Ktm', 'Ktm', 'Ktm']}

In [3]:
df = pd.DataFrame(data)
df

       name  age address
0      Anuj   21     Bkt
1    Aayush   22     Bkt
2    Ratish   23     Bkt
3    Aenish   24     Ktm
4  Aayushya   25     Ktm
5    Sushil   26     Ktm

In [4]:
df.head()

       name  age address
0      Anuj   21     Bkt
1    Aayush   22     Bkt
2    Ratish   23     Bkt
3    Aenish   24     Ktm
4  Aayushya   25     Ktm

In [5]:
df.tail()

       name  age address
1    Aayush   22     Bkt
2    Ratish   23     Bkt
3    Aenish   24     Ktm
4  Aayushya   25     Ktm
5    Sushil   26     Ktm

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     6 non-null      object
 1   age      6 non-null      int64
 2   address  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

In [7]:
df.describe()

             age
count   6.000000
mean   23.500000
std     1.870829
min    21.000000
25%    22.250000
50%    23.500000
75%    24.750000
max    26.000000

In [8]:
names = df["name"]
names

0        Anuj
1      Aayush
2      Ratish
3      Aenish
4    Aayushya
5      Sushil
Name: name, dtype: object

In [9]:
df[["name", "age"]]

       name  age
0      Anuj   21
1    Aayush   22
2    Ratish   23
3    Aenish   24
4  Aayushya   25
5    Sushil   26

In [ ]:
df["age"] > 25

0    False
1    False
2    False
3    False
4    False
5     True
Name: age, dtype: bool

In [11]:
df[df["age"] > 25]

     name  age address
5  Sushil   26     Ktm

In [12]:
df.loc[df["age"] > 25, ["name", "age"]]

     name  age
5  Sushil   26

In [19]:
df.iloc[0:4, 0:2]

     name  age
0    Anuj   21
1  Aayush   22
2  Ratish   23
3  Aenish   24

In [20]:
df["age"].min()

np.int64(21)